---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.ContinuousRail
source: html/4639561f-0bdd-f2a9-752b-21eb6edadcd2.htm
---
# ContinuousRail Properties

The id of the assembly instance to which the element belongs.